const int Pin_tone = 12; // номер порта зуммера
const byte COUNT_NOTES = 39; // Колличество нот
byte PWM_led_R, PWM_led_G, PWM_led_B;
byte pin_led_R = 5; // Номер контакта для Светодиода R
byte pin_led_G = 6; // Номер контакта для Светодиода G
byte pin_led_B = 7; // Номер контакта для Светодиода B
//частоты ноты
int frequences[COUNT_NOTES] = {
  392, 392, 392, 311, 466, 392, 311, 466, 392,
  587, 587, 587, 622, 466, 369, 311, 466, 392,
  784, 392, 392, 784, 739, 698, 659, 622, 659,
  415, 554, 523, 493, 466, 440, 466,
  311, 369, 311, 466, 392
};
//длительность нот
int durations[COUNT_NOTES] = {
  350, 350, 350, 250, 100, 350, 250, 100, 700,
  350, 350, 350, 250, 100, 350, 250, 100, 700,
  350, 250, 100, 350, 250, 100, 100, 100, 450,
  150, 350, 250, 100, 100, 100, 450,
  150, 350, 250, 100, 750
};
void setup() {
  pinMode(pin_led_R, OUTPUT);  // Настраиваем контакт на выход
  pinMode(pin_led_G, OUTPUT);  // Настраиваем контакт на выход
  pinMode(pin_led_B, OUTPUT);  // Настраиваем контакт на выход
}
void loop() {
  for (int i = 0; i <= COUNT_NOTES; i++ ) { // Цикл от 0 до количества нот
    tone(Pin_tone, frequences[i]); // Включаем звук, определенной частоты
    PWM_led_R = random(0, 254); // Генерируем случайное число от 0 до 254
    PWM_led_G = random(0, 254); // Генерируем случайное число от 0 до 254
    PWM_led_B = random(0, 254); // Генерируем случайное число от 0 до 254
    analogWrite(pin_led_R, PWM_led_R); // Зажигаем светодлиод на случайно сгенерированную яркость
    analogWrite(pin_led_G, PWM_led_G); // Зажигаем светодлиод на случайно сгенерированную яркость
    analogWrite(pin_led_B, PWM_led_B); // Зажигаем светодлиод на случайно сгенерированную яркость
    delay(durations[i] * 2);  // Дауза для заданой ноты
    noTone(Pin_tone); // Останавливаем звук
  }
}
